import React from 'react';

import { Container, H2 } from './styles/main'

import MoneyPerYear from './sectors/MoneyPerYear'
import DivideMoney from './sectors/DivideMoney'
import NumberOfStudents from './sectors/NumberOfStudents'
import NumberOfTeachers from './sectors/NumberOfTeachers'
import NumberOfSchools from './sectors/NumberOfSchools'

function App() {
  return (
    <Container>
      <H2>รายงานการวิเคราะห์รายจ่าย</H2>
      <H2>งบประมาณกระทรวงศึกษาธิการ</H2>
      
      <MoneyPerYear />
      <p>งบประมาณรายจ่ายด้านการศึกษามีแนวโน้มเพิ่มขึ้นตามจำนวนปีที่เพิ่มขึ้น โดยเฉลี่ยการจัดสรรงบประมาณของทุกปี จะได้ผลดังนี้</p>
      <DivideMoney />
      <p>โดยงบประมาณส่วนใหญ่จะถูกให้จ่ายในระดับชั้น การศึกษาขั้นพื้นฐานคือ ระดับก่อนประถมวัย ประถมศึกษา และ มัธยมศึกษา โดยคิดเป็น 70.1% ของงบประมาณที่ได้รับทั้งหมด ตามด้วย ระดับชั้นอุดมศึกษา โดยคิดเป็น 17.3% </p>
      <p>จากค่าในตารางด้านบน ช่วยให้แยกได้ว่า จำนวนนักเรียนระดับชั้นประถมศึกษา ไปจนถึงระดับชั้นมัธยมศึกษาตอนต้น มีจำนวนนักเรียนที่ใกล้เคียงกัน</p>
      <NumberOfStudents />
      <p>จากกราฟ แสดงถึงจำนวนนักเรียนในแต่ละระดับชั้นในแต่ละปีการศึกษา ซึ่งในแต่ละปีมีค่าใกล้เคียงกันและดูเหมือนว่า ไม่มีแนวโน้มบนข้อมูลชุดนี้ </p>
      <p>ซึ่งจากข้อสรุปที่ได้ว่า งบประมาณการศึกษานั้นมีแนวโน้มเพิ่มขึ้น แต่เมื่อนำมาเปรียบเทียบกับจำนวนนักเรียนแล้ว กลับเห็นได้ว่า จำนวนนักเรียนไม่ได้เพิ่มขึ้นตามงบประมาณในแต่ละปี ซึ่งมีจำนวนที่ค่อนข้างคงที่</p>
      <p>จากข้อมูลจำนวนครูมีค่าเฉลี่ยอยู่ที่ 659,747 คน และมีส่วนเบี่ยงเบนมาตราฐานอยู่ที่ 31,228 คน</p>
      <NumberOfTeachers />
      <p>จากภาพจะเห็นได้ว่าจำนวนครูนั้นมีแนวโน้มเพิ่มขึ้นแล้วค่อยลงลด ซึ่งเป็นแนวโน้มที่ใกล้เคียงกับการใช้จ่ายงบประมาณ</p>
      <p>จากการศึกษาข้อมูลจำนวนสถานศึกษา จำนวนสถานศึกษาโดยรวมทุกปีมีค่าเฉลี่ยอยู่ที่ 38,366 แห่ง และ มีส่วนเบี่ยงเบนมาตราฐานอยู่ที่ 272</p>
      <p>จากกราฟ จำนวนสถานศึกษานั้นไม่มีแนวโน้ม และข้อมูลคงที่ โดยอยู่ในช่วงเฉลี่ยประมาณ 38,366 แห่ง ตามค่าเฉลี่ยที่ได้ ซึ่งไม่เหมือนกับการใช้จ่ายงบประมาณที่มีปริมาณการใช้จ่ายเพิ่มขึ้นในทุกปี</p>
      <NumberOfSchools />
      <h4>สรุปผลที่ได้จาก Descriptive Statistic</h4>
      <ol>
        <li>ข้อมูลการใช้จ่ายงบประมาณมีแนวโน้มเพิ่มขึ้น เมื่อเวลาเพิ่มขึ้น</li>
        <li>ข้อมูลจำนวนนักเรียนคงที่และมีค่าใกล้เคียงกัน ในแต่ละปี</li>
        <li>ข้อมูลจำนวนครูมีแนวโน้มลดลง</li>
        <li>ข้อมูลจำนวนสถานศึกษามีจำนวนคงที่</li>
      </ol>
    </Container>
  );
}

export default App;
